app/controllers/bookmarks_controller.rb

SELECT "bookmarks".* FROM "bookmarks"
---
  def index
	@bookmarks = Bookmark.all

INSERT INTO "bookmarks" ("bookmarkName", "created_at", "updated_at") VALUES (?, ?, ?)  [["bookmarkName", "dsfdsf"], ["created_at", "2014-08-27 04:46:26.031092"], ["updated_at", "2014-08-27 04:46:26.031092"]]
---
  def add
   Bookmark.create(:bookmarkName => params[:bookmark_text])